# Урок 3. Массивы. Кортежи. Множества. Списки

# 2. Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив надо заполнить значениями
# 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля), т.к. именно в этих позициях первого
# массива стоят четные числа.

array_1 = input('Введите элементы через пробел: ')
array_1 = array_1.split()
array_1 = [int(i) for i in array_1]

even_array = []

for i in range(len(array_1)):
    if array_1[i] % 2 == 0:
        even_array.append(i)

print(f'Индексы четных чисел из массива: \n {array_1} \n {even_array}')
